bugzilla_bugs_analysis/method2_outputs/step5_extracted_diffs/bug_1933919/regressor_commits/regressor_1931301_3d4472548fb9/dom_base_MutationObservers.cpp.diff
# ==============================================================================
# REGRESSOR COMMIT DIFF
# ==============================================================================
# File: dom/base/MutationObservers.cpp
# Commit: 3d4472548fb9
# Full Hash: 3d4472548fb9d48cce00f59066690611ee20ffcb
# Author: Emilio Cobos Álvarez <emilio@crisal.io>
# Date: 2024-11-26 09:36:10
# Regressor Bug: 1931301
# File Overlap Count: 1
# Description:
#   Bug 1931301 - Notify of removals on a stable state, not mid-remove. r=smaug,masayuki,dshin
#   
#   This simplifies some observers, and makes others a bit more subtle, but I think
#   over-all it is an improvement.
#   
# ==============================================================================

diff -r 20a0394d798f -r 3d4472548fb9 dom/base/MutationObservers.cpp
--- a/dom/base/MutationObservers.cpp	Mon Nov 25 17:56:21 2024 +0000
+++ b/dom/base/MutationObservers.cpp	Mon Nov 25 17:58:40 2024 +0000
@@ -176,17 +176,16 @@
          nsIMutationObserver::kContentInserted);
 }
 
-void MutationObservers::NotifyContentRemoved(nsINode* aContainer,
-                                             nsIContent* aChild,
-                                             nsIContent* aPreviousSibling) {
+void MutationObservers::NotifyContentWillBeRemoved(nsINode* aContainer,
+                                                   nsIContent* aChild) {
   MOZ_ASSERT(aContainer->IsContent() || aContainer->IsDocument(),
              "container must be an nsIContent or an Document");
-  aContainer->OwnerDoc()->Changed();
   MOZ_ASSERT(aChild->GetParentNode() == aContainer,
              "We expect the parent link to be still around at this point");
-  Notify<NotifyPresShell::Before>(
-      aContainer, NOTIFIER(ContentRemoved, aChild, aPreviousSibling),
-      nsIMutationObserver::kContentRemoved);
+  aContainer->OwnerDoc()->Changed();
+  Notify<NotifyPresShell::Before>(aContainer,
+                                  NOTIFIER(ContentWillBeRemoved, aChild),
+                                  nsIMutationObserver::kContentWillBeRemoved);
 }
 
 void MutationObservers::NotifyARIAAttributeDefaultWillChange(