bugzilla_bugs_analysis/method2_outputs/step5_extracted_diffs/bug_1933919/regressor_commits/regressor_1931301_3d4472548fb9/dom_base_MutationObservers.h.diff
# ==============================================================================
# REGRESSOR COMMIT DIFF
# ==============================================================================
# File: dom/base/MutationObservers.h
# Commit: 3d4472548fb9
# Full Hash: 3d4472548fb9d48cce00f59066690611ee20ffcb
# Author: Emilio Cobos Álvarez <emilio@crisal.io>
# Date: 2024-11-26 09:36:10
# Regressor Bug: 1931301
# File Overlap Count: 1
# Description:
#   Bug 1931301 - Notify of removals on a stable state, not mid-remove. r=smaug,masayuki,dshin
#   
#   This simplifies some observers, and makes others a bit more subtle, but I think
#   over-all it is an improvement.
#   
# ==============================================================================

diff -r 20a0394d798f -r 3d4472548fb9 dom/base/MutationObservers.h
--- a/dom/base/MutationObservers.h	Mon Nov 25 17:56:21 2024 +0000
+++ b/dom/base/MutationObservers.h	Mon Nov 25 17:58:40 2024 +0000
@@ -94,14 +94,13 @@
    */
   static void NotifyContentInserted(nsINode* aContainer, nsIContent* aChild);
   /**
-   * Send ContentRemoved notifications to nsIMutationObservers
+   * Send ContentWillBeRemoved notifications to nsIMutationObservers
    * @param aContainer        Node from which child was removed
    * @param aChild            Removed child
-   * @param aPreviousSibling  Previous sibling of the removed child
-   * @see nsIMutationObserver::ContentRemoved
+   * @see nsIMutationObserver::ContentWillBeRemoved
    */
-  static void NotifyContentRemoved(nsINode* aContainer, nsIContent* aChild,
-                                   nsIContent* aPreviousSibling);
+  static void NotifyContentWillBeRemoved(nsINode* aContainer,
+                                         nsIContent* aChild);
 
   /**
    * Send ParentChainChanged notifications to nsIMutationObservers