bugzilla_bugs_analysis/method2_outputs/step5_extracted_diffs/bug_1933919/regressor_commits/regressor_1931301_3d4472548fb9/dom_base_nsIMutationObserver.h.diff
# ==============================================================================
# REGRESSOR COMMIT DIFF
# ==============================================================================
# File: dom/base/nsIMutationObserver.h
# Commit: 3d4472548fb9
# Full Hash: 3d4472548fb9d48cce00f59066690611ee20ffcb
# Author: Emilio Cobos Álvarez <emilio@crisal.io>
# Date: 2024-11-26 09:36:10
# Regressor Bug: 1931301
# File Overlap Count: 1
# Description:
#   Bug 1931301 - Notify of removals on a stable state, not mid-remove. r=smaug,masayuki,dshin
#   
#   This simplifies some observers, and makes others a bit more subtle, but I think
#   over-all it is an improvement.
#   
# ==============================================================================

diff -r 20a0394d798f -r 3d4472548fb9 dom/base/nsIMutationObserver.h
--- a/dom/base/nsIMutationObserver.h	Mon Nov 25 17:56:21 2024 +0000
+++ b/dom/base/nsIMutationObserver.h	Mon Nov 25 17:58:40 2024 +0000
@@ -243,12 +243,10 @@
   virtual void ContentInserted(nsIContent* aChild) = 0;
 
   /**
-   * Notification that a content node has been removed from the child list of
-   * another node in the tree.
+   * Notification that a content node is about to be removed from the child list
+   * of another node in the tree.
    *
-   * @param aChild     The child that was removed.
-   * @param aPreviousSibling The previous sibling to the child that was removed.
-   *                         Can be null if there was no previous sibling.
+   * @param aChild     The child that will be removed.
    *
    * @note Callers of this method might not hold a strong reference to the
    *       observer.  The observer is responsible for making sure it stays
@@ -256,8 +254,7 @@
    *       assume that this call will happen when there are script blockers on
    *       the stack.
    */
-  virtual void ContentRemoved(nsIContent* aChild,
-                              nsIContent* aPreviousSibling) = 0;
+  virtual void ContentWillBeRemoved(nsIContent* aChild) = 0;
 
   /**
    * The node is in the process of being destroyed. Calling QI on the node is
@@ -268,7 +265,7 @@
    * NOTE: This notification is only called on observers registered directly
    * on the node. This is because when the node is destroyed it can not have
    * any ancestors. If you want to know when a descendant node is being
-   * removed from the observed node, use the ContentRemoved notification.
+   * removed from the observed node, use the ContentWillBeRemoved notification.
    *
    * @param aNode The node being destroyed.
    *
@@ -312,7 +309,7 @@
     kAttributeSetToCurrentValue = 1 << 4,
     kContentAppended = 1 << 5,
     kContentInserted = 1 << 6,
-    kContentRemoved = 1 << 7,
+    kContentWillBeRemoved = 1 << 7,
     kNodeWillBeDestroyed = 1 << 8,
     kParentChainChanged = 1 << 9,
     kARIAAttributeDefaultWillChange = 1 << 10,
@@ -371,8 +368,7 @@
   virtual void ContentInserted(nsIContent* aChild) override;
 
 #define NS_DECL_NSIMUTATIONOBSERVER_CONTENTREMOVED \
-  virtual void ContentRemoved(nsIContent* aChild,  \
-                              nsIContent* aPreviousSibling) override;
+  virtual void ContentWillBeRemoved(nsIContent* aChild) override;
 
 #define NS_DECL_NSIMUTATIONOBSERVER_NODEWILLBEDESTROYED \
   virtual void NodeWillBeDestroyed(nsINode* aNode) override;
@@ -419,8 +415,7 @@
       nsAtom* aAttribute, int32_t aModType, const nsAttrValue* aOldValue) {}   \
   void _class::ContentAppended(nsIContent* aFirstNewContent) {}                \
   void _class::ContentInserted(nsIContent* aChild) {}                          \
-  void _class::ContentRemoved(nsIContent* aChild,                              \
-                              nsIContent* aPreviousSibling) {}                 \
+  void _class::ContentWillBeRemoved(nsIContent* aChild) {}                     \
   void _class::ParentChainChanged(nsIContent* aContent) {}                     \
   void _class::ARIAAttributeDefaultWillChange(                                 \
       mozilla::dom::Element* aElement, nsAtom* aAttribute, int32_t aModType) { \