bugzilla_bugs_analysis/method2_outputs/step5_extracted_diffs/bug_1933919/regressor_commits/regressor_1931301_3d4472548fb9/dom_base_nsStubMutationObserver.cpp.diff
# ==============================================================================
# REGRESSOR COMMIT DIFF
# ==============================================================================
# File: dom/base/nsStubMutationObserver.cpp
# Commit: 3d4472548fb9
# Full Hash: 3d4472548fb9d48cce00f59066690611ee20ffcb
# Author: Emilio Cobos Álvarez <emilio@crisal.io>
# Date: 2024-11-26 09:36:10
# Regressor Bug: 1931301
# File Overlap Count: 1
# Description:
#   Bug 1931301 - Notify of removals on a stable state, not mid-remove. r=smaug,masayuki,dshin
#   
#   This simplifies some observers, and makes others a bit more subtle, but I think
#   over-all it is an improvement.
#   
# ==============================================================================

diff -r 20a0394d798f -r 3d4472548fb9 dom/base/nsStubMutationObserver.cpp
--- a/dom/base/nsStubMutationObserver.cpp	Mon Nov 25 17:56:21 2024 +0000
+++ b/dom/base/nsStubMutationObserver.cpp	Mon Nov 25 17:58:40 2024 +0000
@@ -88,10 +88,9 @@
     mOwner->ContentInserted(aChild);
   }
 
-  void ContentRemoved(nsIContent* aChild,
-                      nsIContent* aPreviousSibling) override {
+  void ContentWillBeRemoved(nsIContent* aChild) override {
     MOZ_ASSERT(mOwner);
-    mOwner->ContentRemoved(aChild, aPreviousSibling);
+    mOwner->ContentWillBeRemoved(aChild);
   }
 
   void NodeWillBeDestroyed(nsINode* aNode) override {