bugzilla_bugs_analysis/method2_outputs/step5_extracted_diffs/bug_1933919/regressor_commits/regressor_1931301_3d4472548fb9/layout_forms_ListMutationObserver.cpp.diff
# ==============================================================================
# REGRESSOR COMMIT DIFF
# ==============================================================================
# File: layout/forms/ListMutationObserver.cpp
# Commit: 3d4472548fb9
# Full Hash: 3d4472548fb9d48cce00f59066690611ee20ffcb
# Author: Emilio Cobos Álvarez <emilio@crisal.io>
# Date: 2024-11-26 09:36:10
# Regressor Bug: 1931301
# File Overlap Count: 1
# Description:
#   Bug 1931301 - Notify of removals on a stable state, not mid-remove. r=smaug,masayuki,dshin
#   
#   This simplifies some observers, and makes others a bit more subtle, but I think
#   over-all it is an improvement.
#   
# ==============================================================================

diff -r 20a0394d798f -r 3d4472548fb9 layout/forms/ListMutationObserver.cpp
--- a/layout/forms/ListMutationObserver.cpp	Mon Nov 25 17:56:21 2024 +0000
+++ b/layout/forms/ListMutationObserver.cpp	Mon Nov 25 17:58:40 2024 +0000
@@ -76,8 +76,7 @@
   mOwningElementFrame->InvalidateFrame();
 }
 
-void ListMutationObserver::ContentRemoved(nsIContent* aChild,
-                                          nsIContent* aPreviousSibling) {
+void ListMutationObserver::ContentWillBeRemoved(nsIContent* aChild) {
   mOwningElementFrame->InvalidateFrame();
 }
 